DMW.Enums.DispelSpells = {
    --DH
    [278326] = {"Magic"},
    --Druid
    [2782] = {"Curse", "Poison"},
    [2908] = {""},
    [88423] = {"Curse", "Magic", "Poison"},
    --Hunter
    [264028] = {"Magic", ""},
    [254056] = {"Magic", ""},
    [254262] = {"Magic", ""},
    [264263] = {"Magic", ""},
    [264264] = {"Magic", ""},
    [264265] = {"Magic", ""},
    [264266] = {"Magic", ""},
    --Monk
    [115450] = {"Disease", "Magic", "Poison"},
    [218164] = {"Disease", "Poison"},
    --Paladin
    [4987] = {"Disease", "Magic", "Poison"},
    [213644] = {"Disease", "Poison"},
    --Priest
    [527] = {"Disease", "Magic"},
    [528] = {"Magic"},
    [32375] = {"Magic"},
    [213634] = {"Disease"},
    --Shaman
    [370] = {"Magic"},
    [51886] = {"Curse"},
    [77130] = {"Curse", "Magic"},
    --Warlock
    [19505] = {"Magic"},
    [119905] = {"Magic"},
    [132411] = {"Magic"},
    --Mage
    [475] = {"Curse"},
}

DMW.Enums.SpecialDispel = {
    [275014] = {Range = 3},
    [261440] = {Range = 6},
    [252781] = {Range = 8},
    [255371] = {Stacks = 2},
    [276031] = {Stacks = 2},
    [269301] = {Stacks = 3},
}

DMW.Enums.NoDispel = {
    [282566] = true
}

DMW.Enums.ControlDispel = {
    [28272]  = {"SheepMode"},
    [118] = {"PigMode"},
    [24394] = {"Intimidation"},
    [132169] = {"StormBolt"},
    [5246] = {"IntimidatingShout"},
    [82691] = {"IceRing"},
    [31661] = {"FireDragon"},
    [3355] = {"IceTrap"},
    [117526] = {"束缚射击"},
    [853] = {"制裁之锤"},
    [20066] = {"忏悔"},
    [105421] = {"盲目之光"},
    [118699] = {"恐惧"},
    [6789] = {"死亡缠绕"},
    [22703] = {"地狱火眩晕"},
    [30283] = {"暗影之怒"},
    [6358] = {"诱惑"},
    [8122] = {"心灵尖啸"},
    [605] = {"心灵控制"},
    [200200] = {"圣言术罚"},
    [119381] = {"扫堂腿"},
    [115078] = {"分筋错骨"},
    [211881] = {"邪能爆发"},
    [179057] = {"混乱新星"},
    [207685] = {"悲苦咒符"},
    [217832] = {"禁锢"},
    [6770] = {"闷棍"},
    [2094] = {"致盲"},
    [1833] = {"偷袭"},
    [408] = {"肾击"},
    [199804] = {"正中眉心"},
    [33786] = {"旋风"},
    [203123] = {"割碎"},
    [155722] = {"斜略"},
    [5211] = {"蛮力猛击"},
    [99] = {"夺魂咆哮"},
    [108194] = {"窒息"},
    [207167] = {"致盲冰雨"},
    [182387] = {"地震术"},
}